class relation_search:

    def search(self,question):
        E3 = ['3E']
        E3_分类 = ['能源', '经济', '环境']
        能源大体分类 = ['一次能源', '二次能源']
        能源具体分类 = ['煤炭', '焦炭', '原油', '石油', '汽油', '煤油', '柴油', '燃料油', '液化石油气', '天然气',
                        '核能', '风能', '太阳能', '水能', '生物质能', '海洋能', '地热能', '潮汐能', '电力']
        一次能源具体分类 = ['煤炭', '原油', '石油', '天然气', '核能', '风能', '太阳能', '水能', '生物质能', '海洋能',
                            '地热能', '潮汐能']
        二次能源具体分类 = ['焦炭', '汽油', '煤油', '柴油', '燃料油', '液化石油气', '电力']
        电力具体分类 = ['火电', '核电', '风电', '水电', '太阳能发电', '生物质发电', '海洋能发电', '地热能发电',
                        '潮汐能发电']
        环境大体分类 = ['废气污染物', '废水污染物', '固体污染物', '噪声污染']
        环境具体分类 = ['氮氧化物', '颗粒物', '二氧化硫', '二氧化氮', '可吸入颗粒物(PM10)', '细颗粒物(PM2.5)',
                        '一氧化碳', '臭氧', '化学需氧量', '氨氮化合物', '总氮', '总磷', '石油类', '挥发酚',
                        '总铅', '总汞', '总镉', '六价铬', '总铬', '总砷', '一般工业固体废物', '危险废物', '生活垃圾',
                        '无害化处理厂', '卫生填埋厂', '焚烧厂', '其他垃圾处理厂', '道路交通噪声', '区域环境噪声']
        废弃污染物具体分类 = ['氮氧化物', '颗粒物', '二氧化硫', '二氧化氮', '可吸入颗粒物(PM10)', '细颗粒物(PM2.5)',
                              '一氧化碳', '臭氧']
        废水污染物具体分类 = ['化学需氧量', '氨氮化合物', '氮', '磷', '石油类', '挥发酚', '铅', '汞', '镉', '六价铬',
                              '铬', '砷']
        固体污染物具体分类 = ['一般工业固体废物', '危险废物', '生活垃圾', '无害化处理厂', '卫生填埋厂', '焚烧厂',
                              '其他垃圾处理厂']
        噪声污染具体分类 = ['道路交通噪声', '区域环境噪声']
        经济大体分类 = ['经济活动', '国民经济核算体系']
        经济活动大体分类 = ['生产环节', '消费环节', '交换环节', '分配环节']
        生产环节具体分类 = ['农林牧渔业', '工业', '建筑业']
        消费环节具体分类 = ['住宿和餐饮业']
        交换环节具体分类 = ['批发和零售业', '交通运输仓储和邮政业', '房地产业']
        分配环节具体分类 = ['金融业']
        国民经济核算体系大体分类 = ['经济循环账户', '社会再生产核算表']
        经济循环账户具体分类 = ['国内生产总值', '国内生产总值构成', '国内生产总值指数', '不变价国内生产总值',
                                '不变价国内生产总值指数', '分行业增加值', '三次产业和主要行业贡献率',
                                '三次产业和主要行业对国内生产总值的拉动', '地区生产总值', '地区生产总值指数',
                                '地区生产总值占比', '支出法国内生产总值', '生产总值', '三大需求对国内生产总值的贡献率',
                                '货物与服务净出口']
        社会再生产核算表具体分类 = ['投入产出基本流量表', '金融交易资金流量表', '非金融交易资金流量表']
        list1 = [E3, 能源大体分类, 一次能源具体分类, 二次能源具体分类, 电力具体分类, 环境大体分类, 废弃污染物具体分类,
                 废水污染物具体分类, 固体污染物具体分类, 噪声污染具体分类, 经济大体分类, 经济活动大体分类,
                 生产环节具体分类, 消费环节具体分类, 交换环节具体分类, 分配环节具体分类, 国民经济核算体系大体分类,
                 经济循环账户具体分类, 社会再生产核算表具体分类, E3_分类]
        list2 = ['3E', '能源大体分类', '一次能源具体分类', '二次能源具体分类', '电力具体分类', '环境大体分类',
                 '废弃污染物具体分类', '废水污染物具体分类', '固体污染物具体分类', '噪声污染具体分类', '经济大体分类',
                 '经济活动大体分类', '生产环节具体分类', '消费环节具体分类', '交换环节具体分类', '分配环节具体分类',
                 '国民经济核算体系大体分类', '经济循环账户具体分类', '社会再生产核算表具体分类', '3E分类']
        b=question
        st=[]
        leibie=[]
        t=2
        while t>0:
            q=0
            s = 0
            for list in list1:
                for i in list:
                    if i in b:
                        st.append(i)
                        leibie.append(list2[s])
                        b=b.replace(i,'',1)
                        q=1
                    if q==1 :
                        break
                if q == 1:
                    break
                s+=1
            t-=1

        if len(leibie)!=2:
            return
        if leibie[0]==leibie[1]:
            a=leibie[0].replace('具体分类','')
            b=a.replace('大体分类','')
            c=b.replace('分类','')
            ans=(f'{st[0]}和{st[1]}属于同一类别,都属于{c}')
        else:
            if leibie[0]=='E3':
                ans=(f'{st[1]}属于{st[0]}')
            elif leibie[1]=='E3':
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='能源' and (leibie[1]=='能源大体分类' or leibie[1]=='一次能源具体分类' or leibie[1]=='二次能源具体分类' or leibie[1]=='电力具体分类'):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='能源' and (leibie[0]=='能源大体分类' or leibie[0]=='一次能源具体分类' or leibie[0]=='二次能源具体分类' or leibie[0]=='电力具体分类'):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='环境' and (leibie[1]=='环境大体分类' or leibie[1]=='废弃污染物具体分类' or leibie[1]=='废水污染物具体分类'or leibie[1]=='固体污染物具体分类' or leibie[1]=='噪声污染具体分类'):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='环境' and (leibie[0]=='环境大体分类' or leibie[0]=='废弃污染物具体分类' or leibie[0]=='废水污染物具体分类'or leibie[0]=='固体污染物具体分类' or leibie[0]=='噪声污染具体分类'):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='经济' and (leibie[1]=='经济大体分类' or leibie[1]=='经济活动大体分类' or leibie[1]=='生产环节具体分类'or leibie[1]=='消费环节具体分类' or leibie[1]=='交换环节具体分类' or leibie[1]=='分配环节具体分类'or leibie[1]=='国民经济核算体系大体分类'or leibie[1]=='经济循环账户具体分类'or leibie[1]=='社会再生产核算表具体分类'):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='经济' and (leibie[0]=='经济大体分类' or leibie[0]=='经济活动大体分类' or leibie[0]=='生产环节具体分类'or leibie[0]=='消费环节具体分类' or leibie[0]=='交换环节具体分类' or leibie[0]=='分配环节具体分类'or leibie[0]=='国民经济核算体系大体分类'or leibie[0]=='经济循环账户具体分类'or leibie[0]=='社会再生产核算表具体分类'):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='一次能源' and (leibie[1]=='一次能源具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='一次能源' and (leibie[0]=='一次能源具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='二次能源' and (leibie[1]=='二次能源具体分类' or leibie[1]=='电力具体分类'):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='二次能源' and (leibie[0]=='二次能源具体分类' or leibie[0]=='电力具体分类'):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='电力' and (leibie[1]=='电力具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='电力' and (leibie[0]=='电力具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='废气污染物' and (leibie[1]=='废弃污染物具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='废气污染物' and (leibie[0]=='废弃污染物具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='废水污染物' and (leibie[1]=='废水污染物具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='废水污染物' and (leibie[0]=='废水污染物具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='固体污染物' and (leibie[1]=='固体污染物具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='固体污染物' and (leibie[0]=='固体污染物具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='噪声污染' and (leibie[1]=='噪声污染具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='噪声污染' and (leibie[0]=='噪声污染具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='经济活动' and (leibie[1]=='经济活动大体分类' or leibie[1]=='生产环节具体分类' or  leibie[1]=='消费环节具体分类' or leibie[1]=='交换环节具体分类' or leibie[1]=='分配环节具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='经济活动' and (leibie[0]=='经济活动大体分类' or leibie[0]=='生产环节具体分类' or  leibie[0]=='消费环节具体分类' or leibie[0]=='交换环节具体分类' or leibie[0]=='分配环节具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='国民经济核算体系' and (leibie[1]=='国民经济核算体系大体分类' or leibie[1]=='经济循环账户具体分类' or  leibie[1]=='社会再生产核算表具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='国民经济核算体系' and (leibie[0]=='国民经济核算体系大体分类' or leibie[0]=='经济循环账户具体分类' or  leibie[0]=='社会再生产核算表具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='生产环节' and ( leibie[1]=='生产环节具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='生产环节' and ( leibie[0]=='生产环节具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='消费环节' and ( leibie[1]=='消费环节具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='消费环节' and ( leibie[0]=='消费环节具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='交换环节' and ( leibie[1]=='交换环节具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='交换环节' and ( leibie[0]=='交换环节具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='分配环节' and ( leibie[1]=='分配环节具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='分配环节' and ( leibie[0]=='分配环节具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='经济循环账户' and ( leibie[1]=='经济循环账户具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='经济循环账户' and ( leibie[0]=='经济循环账户具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif st[0]=='社会再生产核算表' and ( leibie[1]=='社会再生产核算表具体分类' ):
                ans=(f'{st[1]}属于{st[0]}')
            elif st[1]=='社会再生产核算表' and ( leibie[0]=='社会再生产核算表具体分类' ):
                ans=(f'{st[0]}属于{st[1]}')
            elif (leibie[0]=='能源大体分类' or leibie[0]=='一次能源具体分类'or leibie[0]=='二次能源具体分类'or leibie[0]=='电力具体分类') and (leibie[1]=='能源大体分类' or leibie[1]=='一次能源具体分类'or leibie[1]=='二次能源具体分类'or leibie[1]=='电力具体分类'):
                ans=(f'{st[0]}和{st[1]}并无直接关系，但都属于能源')
            elif (leibie[0]=='环境大体分类' or leibie[0]=='废弃污染物具体分类'or leibie[0]=='废水污染物具体分类'or leibie[0]=='固体污染物具体分类' or leibie[0]=='噪声污染具体分类') and (leibie[1]=='环境大体分类' or leibie[1]=='废弃污染物具体分类'or leibie[1]=='废水污染物具体分类'or leibie[1]=='固体污染物具体分类' or leibie[1]=='噪声污染具体分类'):
                ans=(f'{st[0]}和{st[1]}并无直接关系，但都属于环境')
            elif (leibie[1]=='经济大体分类' or leibie[1]=='经济活动大体分类' or leibie[1]=='生产环节具体分类'or leibie[1]=='消费环节具体分类' or leibie[1]=='交换环节具体分类' or leibie[1]=='分配环节具体分类'or leibie[1]=='国民经济核算体系大体分类'or leibie[1]=='经济循环账户具体分类'or leibie[1]=='社会再生产核算表具体分类') and(leibie[0]=='经济大体分类' or leibie[0]=='经济活动大体分类' or leibie[0]=='生产环节具体分类'or leibie[0]=='消费环节具体分类' or leibie[0]=='交换环节具体分类' or leibie[0]=='分配环节具体分类'or leibie[0]=='国民经济核算体系大体分类'or leibie[0]=='经济循环账户具体分类'or leibie[0]=='社会再生产核算表具体分类'):
                ans=(f'{st[0]}和{st[1]}并无直接关系，但都属于经济')
            else:
                ans=(f'{st[0]}和{st[1]}并无直接关系，但都属于3E')
        return ans


